#+TITLE: Pathfinder Character Sheet
#+AUTHOR: Jesus Ramos

# Just fill in the relevant information in the tables and recalculate all tables
# M-x org-table-recalculate-buffer-tables

* Basic Character Info
  - Name :: Tsardok
  - Race :: Half-Orc
  - Gender :: Male
  - Height :: 6ft
  - Weight :: 172lbs
  - Age :: 25
  - Alignment :: Lawful Good
  - Deity :: Shelyn
  - Background Occupation :: Being awesome
  - Languages :: Common, Orc

* Character Stats
  #+NAME:Stats
  |---+--------------+-------+----------+------+----------+---------+------|
  | ! | Stat         | Total | Modifier | Base | Inherent | Enhance | Misc |
  |---+--------------+-------+----------+------+----------+---------+------|
  | # | Strength     |    17 |        3 |   14 |        3 |         |      |
  | # | Dexterity    |    10 |        0 |   10 |          |         |      |
  | # | Constitution |    14 |        2 |   14 |          |         |      |
  | # | Intelligence |    10 |        0 |   10 |          |         |      |
  | # | Wisdom       |    10 |        0 |   10 |          |         |      |
  | # | Charisma     |    14 |        2 |   14 |          |         |      |
  |---+--------------+-------+----------+------+----------+---------+------|
  #+TBLFM: @2$3..@2$3=vsum($5..$8)::@2$4..@7$4=floor(($3 - 10) / 2)

* Class
  # This table won't recalculate automatically, just hit TAB on the last row to
  # recalculate
  #+NAME:Class
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  | ! |     HP | HD  | Class Name    | BAB | Skills | Fort | Ref | Will | Levels |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  |   |     49 | d10 | Paladin       |   5 |     10 |    4 |   1 |    4 |      5 |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  |   | Totals |     | Favored Class |     |        |      |     |      |        |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  | # |     49 |     | Paladin       |   5 |     10 |    4 |   1 |    4 |      5 |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  #+TBLFM: @>$2=vsum(@2..@-2)::@>$5..@>$10=vsum(@2..@-2)

* Defense
  #+NAME:Saves
  |---+---------------+-------+------+---------+---------+------|
  | ! | Saving Throws | Total | Base | Ability | Enhance | Misc |
  |---+---------------+-------+------+---------+---------+------|
  | # | Fortitude     |     6 |    4 |       2 |         |      |
  | # | Reflex        |     1 |    1 |       0 |         |      |
  | # | Will          |     4 |    4 |       0 |         |      |
  |---+---------------+-------+------+---------+---------+------|
  #+TBLFM: $5=remote(Stats,@3$Modifier)::@2$3..@4$3=vsum($4..$7)::@2$4=remote(Class, @>$Fort)::@2$5=remote(Stats, @4$Modifier)::@3$4=remote(Class, @>$Ref)::@4$4=remote(Class, @>$Will)::@4$5=remote(Stats, @6$Modifier)

  #+NAME:HP
  |---+--------------+----|
  | # | Base         | 49 |
  |   | Temporary HP |    |
  |---+--------------+----|
  | # | Total        | 49 |
  |---+--------------+----|
  #+TBLFM: @1$3=remote(Class, @2$HP)::@3$3=@1$3+@2$3

* Attacks
  #+NAME:Attacks
  |---+--------+-------+-------------------+---------+------+------|
  | ! |        | Total | Base Attack Bonus | Ability | Size | Misc |
  |---+--------+-------+-------------------+---------+------+------|
  | # | Melee  |     8 |                 5 |       3 |      |      |
  | # | Ranged |     5 |                 5 |       0 |      |      |
  | # | CMB    |     8 |                 5 |       3 |      |      |
  |---+--------+-------+-------------------+---------+------+------|
  #+TBLFM: @2$3..@4$3=vsum($4..$7)::@2$4..@4$4=remote(Class, @>$BAB)::@2$5=remote(Stats, @2$Modifier)::@3$5=remote(Stats, @3$Modifier)::@4$5=remote(Stats, @2$Modifier)

* Skills
  # To mark as a class skill just put a 1 in the class column, org mode doesn't
  # support checkboxes in tables yet. You can add or change the ability the
  # stat depends on by modifying the Stat column.
  #+NAME:Skills
  |---+-------+---------------------+------+-------+-------+---------+---------+------|
  | ! | Class | Skill               | Stat | Total | Ranks | Ability | Trained | Misc |
  |---+-------+---------------------+------+-------+-------+---------+---------+------|
  | # |       | Acrobatics          | Dex  |     0 |       |       0 |         |      |
  | # |       | Appraise            | Int  |     0 |       |       0 |         |      |
  | # |       | Bluff               | Cha  |     2 |       |       2 |         |      |
  | # |       | Climb               | Str  |     3 |       |       3 |         |      |
  | # |     1 | Craft:              | Int  |     0 |       |       0 |         |      |
  | # |       | Craft:              | Int  |     0 |       |       0 |         |      |
  | # |     1 | Diplomacy           | Cha  |    10 |     5 |       2 |       3 |      |
  | # |       | Disable Device      | Dex  |     0 |       |       0 |         |      |
  | # |       | Disguise            | Cha  |     2 |       |       2 |         |      |
  | # |       | Escape Artist       | Dex  |     0 |       |       0 |         |      |
  | # |       | Fly                 | Dex  |     0 |       |       0 |         |      |
  | # |     1 | Handle Animal       | Cha  |     8 |     3 |       2 |       3 |      |
  | # |     1 | Heal                | Wis  |     0 |       |       0 |         |      |
  | # |       | Intimidate          | Cha  |     4 |       |       2 |         |    2 |
  | # |     1 | Knowledge: Nobility | Int  |     4 |     1 |       0 |       3 |      |
  | # |     1 | Knowledge: Religion | Int  |     4 |     1 |       0 |       3 |      |
  | # |       | Linguistics         | Int  |     0 |       |       0 |         |      |
  | # |       | Perception          | Wis  |     0 |       |       0 |         |      |
  | # |       | Perform:            | Cha  |     2 |       |       2 |         |      |
  | # |     1 | Profession:         | Wis  |     0 |       |       0 |         |      |
  | # |     1 | Ride                | Dex  |     0 |       |       0 |         |      |
  | # |     1 | Sense Motive        | Wis  |     0 |       |       0 |         |      |
  | # |       | Sleight of Hand     | Dex  |     0 |       |       0 |         |      |
  | # |     1 | Spellcraft          | Int  |     0 |       |       0 |         |      |
  | # |       | Stealth             | Dex  |     0 |       |       0 |         |      |
  | # |       | Survival            | Wis  |     0 |       |       0 |         |      |
  | # |       | Swim                | Str  |     3 |       |       3 |         |      |
  | # |       | Use Magic Device    | Cha  |     2 |       |       2 |         |      |
  |---+-------+---------------------+------+-------+-------+---------+---------+------|
  #+TBLFM: @2$5..@>$5=vsum($6..$9)::@2$7..@>$7='(cond ((string= $4 "Str") remote(Stats, @2$Modifier)) ((string= $4 "Dex") remote(Stats, @3$Modifier)) ((string= $4 "Int") remote(Stats, @5$Modifier)) ((string= $4 "Wis") remote(Stats, @6$Modifier)) ((string= $4 "Cha") remote(Stats, @7$Modifier)))::@2$8..@>$8=if($2 > 0 && $6 > 0, 3, string(""))

* Inventory

** Equipment
   # Just add new rows for new items
   #+NAME:Equipment
   |---+----------+------+---------------|
   | ! | Quantity | Name | Weight        |
   |---+----------+------+---------------|
   |   |          |      |               |
   |---+----------+------+---------------|
   |   |          |      | Total Weight: |
   |---+----------+------+---------------|
   | # |          |      | 0             |
   |---+----------+------+---------------|
   #+TBLFM: @4$4=vsum(@2$4..@-2$4)

   # Worn magic items
   #+NAME: WornEquipment
   |-----------+---|
   | Head      |   |
   | Face      |   |
   | Throat    |   |
   | Shoulders |   |
   | Body      |   |
   | Torso     |   |
   | Arms      |   |
   | Hands     |   |
   | Ring      |   |
   | Ring      |   |
   | Waist     |   |
   | Feet      |   |
   |-----------+---|


** Magic Items

** Wealth
   #+NAME: Wealth
   |----------+---|
   | Platinum |   |
   | Gold     |   |
   | Silver   |   |
   | Copper   |   |
   |----------+---|

** Bags and Containers
   #+NAME: Bags
   |-----------+--------+--------|
   | Container | Volume | Weight |
   |-----------+--------+--------|
   |           |        |        |
   |-----------+--------+--------|

* Spells

* Notes
